---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotPlanar
source: html/e7a6eb39-0033-015a-24dc-cc3ea162b2cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotPlanar Property

Analytical Panel is not planar.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalPanelNotPlanar { get; }
```